<?xml version="1.0" encoding="UTF-8"?>
<update xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:noNamespaceSchemaLocation="http://www.ofw.fi/xml/2011/java-xmldb-updater/UpdaterSchema.xsd">

  <createTables>
    <table name="MailQueueItem" primaryKeys="id">
      <fields>
        <field name="id" type="java.lang.Long" nullable="false" unique="true" />
        <field name="emailMessage_id" type="java.lang.Long" nullable="true" unique="false" />
        <field name="state" type="java.lang.String" nullable="false" unique="false" />
        <field name="creator_id" type="java.lang.Long" nullable="true" unique="false" />
        <field name="created" type="Types.TIMESTAMP" nullable="false" unique="false" />
        <field name="lastModifier_id" type="java.lang.Long" nullable="true" unique="false" />
        <field name="lastModified" type="Types.TIMESTAMP" nullable="false" unique="false" />
        <field name="archived" type="java.lang.Boolean" nullable="false" unique="false" />
      </fields>
      <foreignKeys>
        <key columns="creator_id" referencedColumns="id" referencedTable="User" />
        <key columns="lastModifier_id" referencedColumns="id" referencedTable="User" />
        <key columns="emailMessage_id" referencedColumns="id" referencedTable="EmailMessage" />
      </foreignKeys>
    </table>
    <table name="UserSetting" primaryKeys="id">
      <fields>
        <field name="id" type="java.lang.Long" nullable="false" unique="true" />
        <field name="user_id" type="java.lang.Long" nullable="true" unique="false" />
        <field name="settingKey" type="java.lang.String" nullable="false" unique="false" />
        <field name="value" type="java.lang.String" nullable="false" unique="false" />
      </fields>
      <foreignKeys>
        <key columns="user_id" referencedColumns="id" referencedTable="User" />
      </foreignKeys>
    </table>
  </createTables>
  
  <sql>update localizedvalue set text="Tavallinen tekstisivu, johon voi kirjoittaa muotoiltua teksti&#228;. Tekstisivuja k&#228;ytet&#228;&#228;n yleens&#228; koko kyselyn tai sen yksitt&#228;isten osioiden esittelemiseen. Tekstisivu ei sis&#228;ll&#228; vastattavia kentti&#228; mutta voit halutessasi sallia sen kommentoinnin." where entry_id=(select description_id from querypagetemplate where iconName='text') and locale='fi';</sql>
  <sql>update localizedvalue set text="Mik&#228;li olet m&#228;&#228;ritt&#228;nyt paneeliisi asiantuntijamatriisin, t&#228;m&#228;n sivun avulla panelistit voivat sijoittaa sille itsens&#228;. Vaikka olisit jo etuk&#228;teen m&#228;&#228;ritt&#228;nyt panelistiesi intressit ja asiantuntijuudet itse, voit t&#228;m&#228;n sivun avulla ker&#228;t&#228; dataa siit&#228;, miten he omakohtaisesti ne kokevat. Vastaajat eiv&#228;t n&#228;e mahdollisesti tekem&#228;&#228;si etuk&#228;teisluokittelua." where entry_id=(select description_id from querypagetemplate where iconName='expertise') and locale='fi';</sql>
  <sql>update localizedvalue set text="T&#228;ll&#228; sivulla panelistit valitsevat ennaltam&#228;&#228;r&#228;tyist&#228; vaihtoehdoista yhden. Sivun avulla voidaan esimerkiksi kysy&#228;, onko panelisti samaa vai eri mielt&#228; jonkin v&#228;itteen kanssa. Valittavien vaihtoehtojen esitystapa on joko vaakasuora radionappilista tai liukus&#228;&#228;din. Raporteissa kertynyt data n&#228;ytet&#228;&#228;n pylv&#228;skaaviona." where entry_id=(select description_id from querypagetemplate where iconName='scale1d') and locale='fi';</sql>
  <sql>update localizedvalue set text="T&#228;ll&#228; sivulla panelistit valitsevat haluamansa kaksi vaihtoehtoa kahdesta eri vaihtoehtojoukosta. Sivun avulla voidaan esimerkiksi pyyt&#228;&#228; panelisteja arvioimaan jonkin v&#228;itteen todenn&#228;k&#246;isyys ja toivottavuus. Valittavien vaihtoehtojen esitystapa on joko vaakasuora radionappilista tai liukus&#228;&#228;din. Raporteissa kertynyt data n&#228;ytet&#228;&#228;n kuplakaaviona." where entry_id=(select description_id from querypagetemplate where iconName='scale2d') and locale='fi';</sql>
  <sql>update localizedvalue set text="T&#228;ll&#228; sivulla panelistit voivat valita arvoja aikajanalta. Sivun avulla voidaan esimerkiksi pyyt&#228;&#228; panelisteja arvioimaan jonkin arvon kehittymist&#228; annetulla aikav&#228;lill&#228;. Voit vapaasti m&#228;&#228;ritt&#228;&#228; aikasarjan X- ja Y-akselien arvot ja niiss&#228; k&#228;ytetyn v&#228;lityksen. Voit my&#246;s esit&#228;ytt&#228;&#228; osan kysytyist&#228; arvoista. Raporteissa kertynyt data n&#228;ytet&#228;&#228;n viivagraafina." where entry_id=(select description_id from querypagetemplate where iconName='timeserie') and locale='fi';</sql>
  <sql>update localizedvalue set text="T&#228;ll&#228; sivulla panelistit voivat valita liukus&#228;&#228;timen avulla yksitt&#228;isen arvon tai arvov&#228;lin. Sivun avulla voidaan esimerkiksi pyyt&#228;&#228; panelisteja m&#228;&#228;ritt&#228;m&#228;&#228;n aikav&#228;li, jolla esitetty teesi on aikaisintaan tai viimeist&#228;&#228;n mahdollinen. Raporteissa kertynyt data n&#228;ytet&#228;&#228;n kuplakaaviona." where entry_id=(select description_id from querypagetemplate where iconName='timeline') and locale='fi';</sql>
  <sql>update localizedvalue set text="T&#228;ll&#228; sivulla panelistit voivat raahata valintoja erilaisiin ryhmiin. Voit m&#228;&#228;ritt&#228;&#228; sek&#228; valittavat arvot ett&#228; ryhm&#228;t, joihin niit&#228; raahataan. Raporteissa jokaisen ryhm&#228;n valinnat n&#228;ytet&#228;&#228;n ympyr&#228;kaaviona." where entry_id=(select description_id from querypagetemplate where iconName='grouping') and locale='fi';</sql>
  <sql>update localizedvalue set text="T&#228;ll&#228; sivulla panelistit voivat valita joukon ennaltam&#228;&#228;ritetyist&#228; vaihtoehdoista. Sivun avulla voidaan esimerkiksi pyyt&#228;&#228; panelisteja valitsemaan annetuista v&#228;itteist&#228; kolme merkitt&#228;vint&#228;. Raporteissa kertynyt data n&#228;ytet&#228;&#228;n pylv&#228;skaaviona." where entry_id=(select description_id from querypagetemplate where iconName='multiselect') and locale='fi';</sql>
  <sql>update localizedvalue set text="T&#228;ll&#228; sivulla panelistit voivat asettaa ennaltam&#228;&#228;ritetyt vaihtoehdot haluamaansa j&#228;rjestykseen. Sivun avulla voidaan esimerkiksi pyyt&#228;&#228; panelisteja j&#228;rjest&#228;m&#228;&#228;n v&#228;itteet t&#228;rkeysj&#228;rjestykseen. Raporteissa kertynyt data n&#228;ytet&#228;&#228;n pylv&#228;skaaviona." where entry_id=(select description_id from querypagetemplate where iconName='ordering') and locale='fi';</sql>
  <sql>update localizedvalue set text="T&#228;lle sivulle voit koostaa haluamasi m&#228;&#228;r&#228;n teksti-, muistio- tai valintalistatyyppisi&#228; lomakekentti&#228;. Sivu on tarkoitettu ensisijaisesti panelistien taustatietojen ker&#228;&#228;miseen. Lomakkeen valintalistakenttien avulla voit lis&#228;ksi suodattaa vastausdataa kyselyn raporttin&#228;kym&#228;ss&#228;." where entry_id=(select description_id from querypagetemplate where iconName='form') and locale='fi';</sql>
  <sql>update localizedvalue set text="T&#228;m&#228; sivu on lomake, joka sis&#228;lt&#228;&#228; jo valmiiksi yleisimmin kysytyt panelistien taustatiedot; sukupuoli, ik&#228;, asema, koulutusaste ja maakunta. Voit muokata tai poistaa n&#228;it&#228; kentti&#228; ja lis&#228;t&#228; tarvittaessa uusia. Kuten lomakesivunkin tapauksessa, kyselyn raporttin&#228;kym&#228;ss&#228; voi suodattaa vastausdataa valintalistakenttien perusteella." where entry_id=(select description_id from querypagetemplate where iconName='backgroundinformationform') and locale='fi';</sql>
  <sql>update localizedvalue set text="T&#228;m&#228; sivun avulla voit luoda kyselyn sis&#228;lt&#228;mist&#228; 2D-skaaloista koosteen. Koosteeseen valittujen sivujen vastaukset n&#228;ytet&#228;&#228;n samassa kuplakaaviossa. Huomaa, ett&#228; voit valita koosteeseen vain yhteensopivia 2D-skaaloja, eli sellaisia, joiden X- ja Y-akseleilla on sama m&#228;&#228;r&#228; arvoja. Koostesivua k&#228;ytet&#228;&#228;n vain vastausten n&#228;ytt&#228;miseen, eli sivu itsess&#228;&#228;n ei sis&#228;ll&#228; mit&#228;&#228;n, mihin panelisti voisi vastata. T&#228;t&#228; sivua ei my&#246;sk&#228;&#228;n n&#228;ytet&#228; kyselyn raportissa." where entry_id=(select description_id from querypagetemplate where iconName='collage2d') and locale='fi';</sql>
  <sql>update localizedvalue set text="An ordinary text page that supports formatted text. Text pages are most often used to introduce the entire query or its individual sections. A text page has no answerable fields but you can set it as commentable." where entry_id=(select description_id from querypagetemplate where iconName='text') and locale='en';</sql>
  <sql>update localizedvalue set text="If you have defined interest and expertise groups in your panel, this page allows the panelists to place themselves in them. Although you might have filled the groups yourself, this page allows you to collect data on how the panelists view themselves. Panelists never see the grouping you might have specified." where entry_id=(select description_id from querypagetemplate where iconName='expertise') and locale='en';</sql>
  <sql>update localizedvalue set text="On this page panelists choose a single option from a predefined set. The page can be used, for example, to ask whether the panelist agrees or disagress with the given thesis. The options to choose from can be displayed either as horizontal radio buttons or a slider. In reports, the collected data is visualized as a bar graph." where entry_id=(select description_id from querypagetemplate where iconName='scale1d') and locale='en';</sql>
  <sql>update localizedvalue set text="This page allows panelists to choose two options from two predefined sets. The page can be used, for example, to ask the panelists to assess the probability and desirability of the given thesis. The options to choose from can be displayed either as horizontal radio buttons or a slider. In reports, the collected data is visualized as a bubble chart." where entry_id=(select description_id from querypagetemplate where iconName='scale2d') and locale='en';</sql>
  <sql>update localizedvalue set text="This page allows panelists to select values on a timeline. The page can be used, for example, to ask panelists to estimate how a value develops during the given time period. You can freely specify the values used on the time series' X and Y axes, as well as their spacing. You can also predefine some of the values being asked. In reports, the collected data is visualized as a line chart." where entry_id=(select description_id from querypagetemplate where iconName='timeserie') and locale='en';</sql>
  <sql>update localizedvalue set text="This page allows panelists to select a single value or a value interval using a slider. The page can be used, for example, to ask the panelists to specify the earliest and latest time when the given thesis is viable. In reports, the collected data is visualized as a bubble chart." where entry_id=(select description_id from querypagetemplate where iconName='timeline') and locale='en';</sql>
  <sql>update localizedvalue set text="This page allows panelists to drag values into groups. You can freely specify both the values and the groups they are dragged into. In reports, the collected data for each group is visualized as a pie chart." where entry_id=(select description_id from querypagetemplate where iconName='grouping') and locale='en';</sql>
  <sql>update localizedvalue set text="This page allows panelists to select multiple items from a predefined set. The page can be used, for example, to ask the panelists to choose three most meaningful arguments from the options given. In reports, the collected data is visualized as a bar chart." where entry_id=(select description_id from querypagetemplate where iconName='multiselect') and locale='en';</sql>
  <sql>update localizedvalue set text="This page allows panelists to order a predefined set of items as they see fit. The page can be used, for example, to ask the panelists to specify the order of importance of the given arguments. In reports, the collected data is visualized as a bar chart." where entry_id=(select description_id from querypagetemplate where iconName='ordering') and locale='en';</sql>
  <sql>update localizedvalue set text="This page can be used to create a form containing text, memo, and selection list fields. The page is primarily used for collecting background information of the panelists. In addition, selection fields can be used to filter responses when viewing the report of the query." where entry_id=(select description_id from querypagetemplate where iconName='form') and locale='en';</sql>
  <sql>update localizedvalue set text="This page is a form that already contains the most common background information fields; sex, age, status, level of education, and region. You can freely edit or remove these fields or add your own. Just like with the form page, selection fields can be used to filter responses when viewing the report of the query." where entry_id=(select description_id from querypagetemplate where iconName='backgroundinformationform') and locale='en';</sql>
  <sql>update localizedvalue set text="This page allows you to create a collage of 2D scale pages in the query. The collage displays the answers of the selected 2D scale pages in a single bubble chart. Notice that you can only select compatible 2D scale pages to the collage, meaning that they have to have the same amount of values in their X and Y axes. The collage page is only used to display responses of other pages, i.e. it does not have any fields that the panelist would be able to answer. Furthermore, this page is not shown in the query report." where entry_id=(select description_id from querypagetemplate where iconName='collage2d') and locale='en';</sql>
  
</update>